torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723bu/hal/hal_btcoex.c
/*
 *	Description:
 *	Setting BT coex antenna isolation type .
 *	coex mechanisn/ spital stream/ best throughput
 *	anttype = 0	,	PSTDMA	/	2SS	/	0.5T	,	bad isolation , WiFi/BT ANT Distance<15cm , (<20dB) for 2,3 antenna
 *	anttype = 1	,	PSTDMA	/	1SS	/	0.5T	,	normal isolaiton , 50cm>WiFi/BT ANT Distance>15cm , (>20dB) for 2 antenna
 *	anttype = 2	,	TDMA	/	2SS	/	T ,		normal isolaiton , 50cm>WiFi/BT ANT Distance>15cm , (>20dB) for 3 antenna
 *	anttype = 3	,	no TDMA	/	1SS	/	0.5T	,	good isolation , WiFi/BT ANT Distance >50cm , (>40dB) for 2 antenna
 *	anttype = 4	,	no TDMA	/	2SS	/	T ,		good isolation , WiFi/BT ANT Distance >50cm , (>40dB) for 3 antenna
 *	wifi only throughput ~ T
 *	wifi/BT share one antenna with SPDT
 */
void hal_btcoex_SetAntIsolationType(PADAPTER padapter, u8 anttype)
{
		PHAL_DATA_TYPE pHalData;
		PBTC_COEXIST	pBtCoexist = &GLBtCoexist;

		/*DBG_871X("####%s , anttype = %d  , %d\n" , __func__ , anttype , __LINE__); */
		pHalData = GET_HAL_DATA(padapter);


		pHalData->bt_coexist.btAntisolation = anttype;

		switch (pHalData->bt_coexist.btAntisolation) {
		case 0:
				pBtCoexist->boardInfo.antType = (u1Byte)BTC_ANT_TYPE_0;
				break;
		case 1:
				pBtCoexist->boardInfo.antType = (u1Byte)BTC_ANT_TYPE_1;
				break;
		case 2:
				pBtCoexist->boardInfo.antType = (u1Byte)BTC_ANT_TYPE_2;
				break;
		case 3:
				pBtCoexist->boardInfo.antType = (u1Byte)BTC_ANT_TYPE_3;
				break;
		case 4:
				pBtCoexist->boardInfo.antType = (u1Byte)BTC_ANT_TYPE_4;
				break;
		}

}

#ifdef CONFIG_LOAD_PHY_PARA_FROM_FILE
int
hal_btcoex_ParseAntIsolationConfigFile(
  PADAPTER		Adapter,
  char*			buffer
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	u32	i = 0 , j = 0;
	char	*szLine , *ptmp;
	int rtStatus = _SUCCESS;
	char param_value_string[10];
	u8 param_value;
	u8 anttype = 4;
	
	u8 ant_num = 3 , ant_distance = 50 , rfe_type = 1; 
	
	typedef struct ant_isolation {
		char *param_name;  /* antenna isolation config parameter name */ 
		u8 *value; /* antenna isolation config parameter value */
	} ANT_ISOLATION;

	ANT_ISOLATION ant_isolation_param[] = {
												{"ANT_NUMBER" , &ant_num},
												{"ANT_DISTANCE" , &ant_distance},
												{"RFE_TYPE" , &rfe_type},												
												{NULL , 0}
										};


	
	/* DBG_871X("===>Hal_ParseAntIsolationConfigFile()\n" ); */
			
	ptmp = buffer;
	for (szLine = GetLineFromBuffer(ptmp) ; szLine != NULL; szLine = GetLineFromBuffer(ptmp)) {
		/* skip comment */ 
		if (IsCommentString(szLine))
			continue;	 

		/* DBG_871X("%s : szLine = %s , strlen(szLine) = %d\n" , __func__ , szLine , strlen(szLine));*/
		for (j = 0 ; ant_isolation_param[j].param_name != NULL ; j++) {
			if (strstr(szLine , ant_isolation_param[j].param_name) != NULL) {
				i = 0;
				while (i < strlen(szLine)) {
					if (szLine[i] != '"')
						++i;
					else {
						/* skip only has one " */
						if (strpbrk(szLine , "\"") == strrchr(szLine , '"')) {
							DBG_871X("Fail to parse parameters , format error!\n");
							break;
						}
						_rtw_memset((PVOID)param_value_string , 0 , 10);
						if (!ParseQualifiedString(szLine , &i , param_value_string , '"' , '"')) {
							DBG_871X("Fail to parse parameters\n");
							return _FAIL;
						} else if (!GetU1ByteIntegerFromStringInDecimal(param_value_string , ant_isolation_param[j].value)) 
							DBG_871X("Fail to GetU1ByteIntegerFromStringInDecimal\n");

						break;
					}
				}
			}
		}
	} 

	/* YiWei 20140716 , for BT coex antenna isolation control */
	/* rfe_type = 0 was SPDT , rfe_type = 1 was coupler */
	if (ant_num == 3 && ant_distance >= 50) 
		anttype = 3;
	else if (ant_num == 2 && ant_distance >= 50 && rfe_type == 1)
		anttype = 2;
	else if (ant_num == 3 && ant_distance >= 15 && ant_distance < 50)
		anttype = 2;
	else if (ant_num == 2 && ant_distance >= 15 && ant_distance < 50 && rfe_type == 1)
		anttype = 2;
	else if ((ant_num == 2 && ant_distance < 15 && rfe_type == 1) || (ant_num == 3 && ant_distance < 15))
		anttype = 1;
	else if (ant_num == 2 && rfe_type == 0)
		anttype = 0;
	else 
		anttype = 0;

	hal_btcoex_SetAntIsolationType(Adapter, anttype); 
						
	DBG_871X("%s : ant_num = %d\n" , __func__ , ant_num);
	DBG_871X("%s : ant_distance = %d\n" , __func__ , ant_distance);
	DBG_871X("%s : rfe_type = %d\n" , __func__ , rfe_type);
	/* DBG_871X("<===Hal_ParseAntIsolationConfigFile()\n"); */
	return rtStatus;	
}


int
hal_btcoex_AntIsolationConfig_ParaFile(
	IN	PADAPTER	Adapter,
	IN	char*	 	pFileName
)
{
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(Adapter);
	int	rlen = 0 , rtStatus = _FAIL;

	_rtw_memset(pHalData->para_file_buf , 0 , MAX_PARA_FILE_BUF_LEN);


	rtw_merge_string(file_path, PATH_LENGTH_MAX, rtw_phy_file_path, pFileName);

	if (rtw_is_file_readable(file_path) == _TRUE)
	{
		rlen = rtw_retrive_from_file(file_path, pHalData->para_file_buf, MAX_PARA_FILE_BUF_LEN);
		if (rlen > 0)
		{
			rtStatus = _SUCCESS;
		}
	}


	if (rtStatus == _SUCCESS) {
		/*DBG_871X("%s(): read %s ok\n", __func__ , pFileName);*/
		rtStatus = hal_btcoex_ParseAntIsolationConfigFile(Adapter , pHalData->para_file_buf);
	} else {
		DBG_871X("%s(): No File %s, Load from *** Array!\n" , __func__ , pFileName);
	}

	return rtStatus;
}
#endif // CONFIG_LOAD_PHY_PARA_FROM_FILE
#endif // CONFIG_BT_COEXIST

